Core/src/src/Documents/AzRyПередачаИмуществаСотруднику/AzRyПередачаИмуществаСотруднику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>AzRyПередачаИмуществаСотруднику</name>
  <registerRecords>AccumulationRegister.AzRyПередачаИмуществаСотруднику</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.AzRyВидыОперацийПередачаИмуществаСотруднику</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>IT</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>HumanResources</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаведующийПоСкладу</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВнеоборотныеАктивы</name>
    <attributes>
      <name>ВнеоборотныйАктив</name>
      <type>
        <types>CatalogRef.ВнеоборотныеАктивы</types>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьЗакупкиСНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/src/InformationRegisters/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Сотрудники</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаОкончанияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>ЗанимаемыхСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </resources>
  <resources>
    <name>ВидУдержанияНДФЛ</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </resources>
  <resources>
    <name>УчастникПенсионногоФонда</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВидУдержанияПФ</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </resources>
  <resources>
    <name>AzRyDivision</name>
    <type>
      <types>CatalogRef.AzRyDivision</types>
    </type>
  </resources>
  <resources>
    <name>УчаствуетДобровольно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/src/AccumulationRegisters/AzRyПередачаИмуществаСотруднику/AzRyПередачаИмуществаСотруднику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>AzRyПередачаИмуществаСотруднику</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВнеоборотныйАктив</name>
    <type>
      <types>CatalogRef.ВнеоборотныеАктивы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.AzRyВидыОперацийПередачаИмуществаСотруднику</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>IT</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>HumanResources</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаведующийПоСкладу</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/src/Enums/AzRyВидыОперацийПередачаИмуществаСотруднику/AzRyВидыОперацийПередачаИмуществаСотруднику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AzRyВидыОперацийПередачаИмуществаСотруднику</name>
  <enumValues>
    <name>Передача</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
</mdclass:Enum>

Core/src/src/Catalogs/ВнеоборотныеАктивы/ВнеоборотныеАктивы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВнеоборотныеАктивы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыВнеоборотныхАктивов</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетАмортизации</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособАмортизации</name>
    <type>
      <types>EnumRef.СпособыНачисленияАмортизацииВнеоборотныхАктивов</types>
    </type>
  </attributes>
  <attributes>
    <name>НачальнаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьВНУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетАмортизацииРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипВнеоборотныеАктивы</name>
    <type>
      <types>CatalogRef.ТипОсновныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодовойПроцентАмортизацииДляУменьшенногоОстатка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛиквидационнаяСтоимостьДляУменьшенногоОстатка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачальнаяСтоимостьДляУменьшенногоОстатка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КадастровыйКод</name>
    <comment>ONESOFT-2337</comment>
    <type>
      <types>CatalogRef.КадастровыеКоды</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентНалогаИмущества</name>
    <comment>ONESOFT-2337</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПокупки</name>
    <comment>ONESOFT-2337</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AzRyОтветственный</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRytmpАмортизационнаяГруппа</name>
    <type>
      <types>CatalogRef.AzRytmpОПТИМУС_АмортизационныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/src/Documents/AzRyПередачаИмуществаСотруднику/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.ВидОперации) Тогда
		Объект.ВидОперации    = ПредопределенноеЗначение("Перечисление.AzRyВидыОперацийПередачаИмуществаСотруднику.Передача");
	КонецЕсли; 
	
	Объект.IT                 = Справочники.AzRyНастройки.ПередачаИмуществаСотруднику_IT.Значение;
	Объект.HumanResources     = Справочники.AzRyНастройки.ПередачаИмуществаСотруднику_HumanResources.Значение;
	Объект.ЗаведующийПоСкладу = Справочники.AzRyНастройки.ПередачаИмуществаСотруднику_ЗаведующийПоСкладу.Значение;
		
КонецПроцедуры

&НаСервере
Процедура ПечатьНаСервере(ТабДок)
	
	ВидОперацииПередача = Объект.ВидОперации = Перечисления.AzRyВидыОперацийПередачаИмуществаСотруднику.Передача;
	Документы.AzRyПередачаИмуществаСотруднику.Печать(ТабДок, Объект.Ссылка, ВидОперацииПередача);
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	ТабДок = Новый ТабличныйДокумент;
	ПечатьНаСервере(ТабДок);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Истина;
	ТабДок.Показать();	
	
КонецПроцедуры

&НаКлиенте
Процедура Печать2(Команда)
		
	ТабДок = Новый ТабличныйДокумент;
	Печать2НаСервере(ТабДок);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Истина;
	ТабДок.Показать();
	
КонецПроцедуры

&НаСервере
Процедура Печать2НаСервере(ТабДок)
	
	Документы.AzRyПередачаИмуществаСотруднику.Печать2(ТабДок, Объект.Ссылка);	
	
КонецПроцедуры

&НаСервере
Процедура Печать3НаСервере(ТабДок)
	
	Документы.AzRyПередачаИмуществаСотруднику.Печать3(ТабДок, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура Печать3(Команда)
	
	ТабДок = Новый ТабличныйДокумент;
	Печать3НаСервере(ТабДок);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Истина;
	ТабДок.Показать();
	
КонецПроцедуры

&НаСервере
Процедура Печать4НаСервере(ТабДок)
	
Документы.AzRyПередачаИмуществаСотруднику.Печать4(ТабДок, Объект.Ссылка);

КонецПроцедуры

&НаКлиенте
Процедура Печать4(Команда)
	
	ТабДок = Новый ТабличныйДокумент;
	Печать4НаСервере(ТабДок);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Истина;
	ТабДок.Показать();
	
КонецПроцедуры

&НаСервере
Процедура СотрудникПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Сотрудник) Тогда
		
		Если Объект.ВнеоборотныеАктивы.Количество() = 0 Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВнеоборотныеАктивы_.Ссылка КАК Ссылка,
			|	ВнеоборотныеАктивы_.AzRyОтветственный КАК AzRyОтветственный,
			|	ВнеоборотныеАктивы_.НачальнаяСтоимостьДляУменьшенногоОстатка КАК НачальнаяСтоимостьДляУменьшенногоОстатка,
			|	AzRyШтрихкодыВнеоборотныеАктивы.Штрихкод КАК Штрихкод
			|ИЗ
			|	Справочник.ВнеоборотныеАктивы КАК ВнеоборотныеАктивы_
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.AzRyШтрихкодыВнеоборотныеАктивы КАК AzRyШтрихкодыВнеоборотныеАктивы
			|		ПО ВнеоборотныеАктивы_.Ссылка = AzRyШтрихкодыВнеоборотныеАктивы.ВнеоборотныеАктивы
			|ГДЕ
			|	ВнеоборотныеАктивы_.AzRyОтветственный = &AzRyОтветственный";
			
			Запрос.УстановитьПараметр("AzRyОтветственный", Объект.Сотрудник.Физлицо);
			
			РезультатЗапроса = Запрос.Выполнить();			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();		
			
			Объект.ВнеоборотныеАктивы.Очистить();
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				НоваяСтрока = Объект.ВнеоборотныеАктивы.Добавить();
				НоваяСтрока.ВнеоборотныйАктив = ВыборкаДетальныеЗаписи.Ссылка;
				НоваяСтрока.СтоимостьЗакупкиСНДС = ВыборкаДетальныеЗаписи.НачальнаяСтоимостьДляУменьшенногоОстатка;
				НоваяСтрока.Штрихкод = ВыборкаДетальныеЗаписи.Штрихкод;
			КонецЦикла;			
			
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(Объект.Сотрудник) И Не ЗначениеЗаполнено(Объект.Организация) Тогда
				
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	СотрудникиСрезПоследних.Организация КАК Организация,
			|	СотрудникиСрезПоследних.Сотрудник КАК Сотрудник,
			|	СотрудникиСрезПоследних.Должность КАК Должность,
			|	СотрудникиСрезПоследних.ГрафикРаботы КАК ГрафикРаботы,
			|	СотрудникиСрезПоследних.AzRyDivision КАК AzRyDivision,
			|	СотрудникиСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
			|ИЗ
			|	РегистрСведений.Сотрудники.СрезПоследних(&ДАТА, Сотрудник = &Сотрудник) КАК СотрудникиСрезПоследних";
			
			Запрос.УстановитьПараметр("ДАТА", Объект.Дата);
			Запрос.УстановитьПараметр("Сотрудник", Объект.Сотрудник);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Объект.Организация = ВыборкаДетальныеЗаписи.Организация;	
				
			КонецЦикла;
					
		КонецЕсли; 
		
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	СотрудникПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Функция ВнеоборотныеАктивыВнеоборотныйАктивПриИзмененииНаСервере(ВнеоборотныйАктив)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	AzRyШтрихкодыВнеоборотныеАктивы.Штрихкод КАК Штрихкод
		|ПОМЕСТИТЬ Ш
		|ИЗ
		|	РегистрСведений.AzRyШтрихкодыВнеоборотныеАктивы КАК AzRyШтрихкодыВнеоборотныеАктивы
		|ГДЕ
		|	AzRyШтрихкодыВнеоборотныеАктивы.ВнеоборотныеАктивы = &ВнеоборотныйАктив
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВнеоборотныеАктивы.НачальнаяСтоимостьДляУменьшенногоОстатка КАК НачальнаяСтоимостьДляУменьшенногоОстатка,
		|	ВнеоборотныеАктивы.Ссылка КАК Ссылка,
		|	Ш.Штрихкод КАК Штрихкод
		|ИЗ
		|	Справочник.ВнеоборотныеАктивы КАК ВнеоборотныеАктивы,
		|	Ш КАК Ш
		|ГДЕ
		|	ВнеоборотныеАктивы.Ссылка = &ВнеоборотныйАктив";
	
	Запрос.УстановитьПараметр("ВнеоборотныйАктив", ВнеоборотныйАктив);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Стр = Новый Структура("НачальнаяСтоимостьДляУменьшенногоОстатка, Штрихкод");
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Стр.НачальнаяСтоимостьДляУменьшенногоОстатка = ВыборкаДетальныеЗаписи.НачальнаяСтоимостьДляУменьшенногоОстатка;	
		Стр.Штрихкод = ВыборкаДетальныеЗаписи.Штрихкод;
		
	КонецЦикла;
	
	Возврат Стр;
	
КонецФункции

&НаКлиенте
Процедура ВнеоборотныеАктивыВнеоборотныйАктивПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ВнеоборотныеАктивы.ТекущиеДанные; 
	
	Ответ = ВнеоборотныеАктивыВнеоборотныйАктивПриИзмененииНаСервере(СтрокаТабличнойЧасти.ВнеоборотныйАктив);
	
	СтрокаТабличнойЧасти.Штрихкод = Ответ.Штрихкод;
	СтрокаТабличнойЧасти.СтоимостьЗакупкиСНДС = Ответ.НачальнаяСтоимостьДляУменьшенногоОстатка;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.AzRyВидыОперацийПередачаИмуществаСотруднику.Возврат") Тогда
		ВидОперацииПриИзмененииНаСервере();	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВидОперацииПриИзмененииНаСервере()
	
	Если Объект.ВидОперации = Перечисления.AzRyВидыОперацийПередачаИмуществаСотруднику.Возврат Тогда
				
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	AzRyПередачаИмуществаСотрудникуОстатки.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
		|	AzRyПередачаИмуществаСотрудникуОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.AzRyПередачаИмуществаСотруднику.Остатки(
		|			&Дата,
		|			Организация = &Организация
		|				И Сотрудник = &Сотрудник) КАК AzRyПередачаИмуществаСотрудникуОстатки";
		
		Запрос.УстановитьПараметр("Дата", Объект.Дата);
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.УстановитьПараметр("Сотрудник", Объект.Сотрудник);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Объект.ВнеоборотныеАктивы.Очистить();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НоваяСтрока = Объект.ВнеоборотныеАктивы.Добавить();
			НоваяСтрока.ВнеоборотныйАктив = ВыборкаДетальныеЗаписи.ВнеоборотныйАктив;
			
			Ответ = ВнеоборотныеАктивыВнеоборотныйАктивПриИзмененииНаСервере(ВыборкаДетальныеЗаписи.ВнеоборотныйАктив);		
			НоваяСтрока.Штрихкод = Ответ.Штрихкод;
			НоваяСтрока.СтоимостьЗакупкиСНДС = Ответ.НачальнаяСтоимостьДляУменьшенногоОстатка;
		КонецЦикла;
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	
	
КонецПроцедуры
